app/controllers/admin_controller.rb

  def dashboard
    @total_pre_orders = PreOrder.count
    @marketing_consent_count = PreOrder.where(marketing_consent: true).count
    @marketing_consent_rate = @total_pre_orders > 0 ? (@marketing_consent_count.to_f / @total_pre_orders * 100).round(1) : 0

    # 버튼 클릭 통계
    @total_clicks = ButtonClick.total_clicks
    @unique_visitors = ButtonClick.unique_visitors
    @today_clicks = ButtonClick.where(clicked_at: Date.current.all_day).count
    @week_clicks = ButtonClick.where(clicked_at: 1.week.ago..Time.current).count

    # 전환율 계산 (사전예약 수 ÷ 총 클릭수)
    @conversion_rate = @total_clicks > 0 ? (@total_pre_orders.to_f / @total_clicks * 100).round(1) : 0

    @pre_orders = PreOrder.order(created_at: :desc)
    @recent_clicks = ButtonClick.order(clicked_at: :desc).limit(10)
---
SELECT COUNT(*) FROM "pre_orders"
SELECT COUNT(*) FROM "pre_orders" WHERE "pre_orders"."marketing_consent" = 1
SELECT COUNT(*) FROM "button_clicks" WHERE "button_clicks"."clicked_at" BETWEEN '2025-07-13 00:00:00' AND '2025-07-13 23:59:59.999999'
SELECT COUNT(*) FROM "button_clicks" WHERE "button_clicks"."clicked_at" BETWEEN '2025-07-06 05:51:28.483389' AND '2025-07-13 05:51:28.483802'
SELECT "pre_orders".* FROM "pre_orders" ORDER BY "pre_orders"."created_at" DESC
SELECT "button_clicks".* FROM "button_clicks" ORDER BY "button_clicks"."clicked_at" DESC LIMIT 10

  def destroy_pre_order
    @pre_order = PreOrder.find(params[:id])
    @pre_order.destroy
---
SELECT "pre_orders".* FROM "pre_orders" WHERE "pre_orders"."id" = 5 LIMIT 1
DELETE FROM "pre_orders" WHERE "pre_orders"."id" = 5

  def destroy_button_click
    @button_click = ButtonClick.find(params[:id])
    @button_click.destroy
---
SELECT "button_clicks".* FROM "button_clicks" WHERE "button_clicks"."id" = 1 LIMIT 1
DELETE FROM "button_clicks" WHERE "button_clicks"."id" = 1