app/controllers/button_clicks_controller.rb

  def create
    @button_click = ButtonClick.new(
      ip_address: request.remote_ip,
      user_agent: request.user_agent,
      clicked_at: Time.current
    )

    if @button_click.save
---
INSERT INTO "button_clicks" ("ip_address", "user_agent", "clicked_at", "created_at", "updated_at") VALUES ('127.0.0.1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', '2025-07-13 06:01:49.019170', '2025-07-13 06:01:49.028028', '2025-07-13 06:01:49.028028') RETURNING "id"