app/controllers/pre_orders_controller.rb

INSERT INTO "pre_orders" ("email", "marketing_consent", "created_at", "updated_at") VALUES ('wjb127@naver.com', 1, '2025-07-13 06:01:52.456149', '2025-07-13 06:01:52.456149') RETURNING "id"
---
  def create
    @pre_order = PreOrder.new(pre_order_params)

    if @pre_order.save