app/models/button_click.rb

  def self.unique_visitors
    distinct.count(:ip_address)
---
SELECT COUNT(DISTINCT "button_clicks"."ip_address") FROM "button_clicks"